# <center>CHALLENGE 4.1<center>

<p>Team Name: snake_case
<p>Student Names: Ashton Callender, Brennan Slade
<p>Student W#s:w0702457, w0735294

## Instructions
Use <b>generic</b> coding style unless hard-coded values are really necessary.<br>
Your code must be efficient and use self-explanatory naming.<br>
Use appropriate Python library methods for each task instead of using loops.<br>
Run your entire code and save <b>BEFORE</b> submitting. Then, submit this <b>saved</b> copy.

## Definitions

AGE_12   : Passengers with age in \[1, 13)<br>
AGE_TEEN : Passengers with age in \[13, 20)<br>
AGE_YOUNG: Passengers with age in \[20, 31)<br>
AGE_OTHER: Passengers with age >= 31

## Imports

In [2]:
import pandas as pd

## Loading Data

Load "titanic.csv" into the data frame object "data"</br>
[train.csv](https://github.com/wesm/pydata-book/blob/2nd-edition/datasets/titanic/train.csv)

In [3]:
data = pd.read_csv("titanic.csv")

data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Calculate Counts

Calculate joint counts for each {Survived_i, Age_j}, i = {Yes, No}, j = {_12, _Teen, _Young, _Other}:

In [4]:
#Clean Data for values that have no value for one of these columns
#If not then the Totals for Ages and Survived would mismatch
data = data[['Age', 'Survived']]
data = data.dropna()

#For Survival Counts
Survived_Yes = len(data.query('Survived == 1'))
Survived_No = len(data.query('Survived == 0'))

#For Age counts
Age_12 = len(data.query('Age >= 1 & Age <= 12'))

Age_Teen = len(data.query('Age >= 13 & Age <= 19'))

Age_Young = len(data.query('Age >= 20 & Age < 31'))

Age_Other = len(data.query('Age >= 31'))


print('Survived_Yes:', Survived_Yes, '\nSurvived_No:', Survived_No, '\n\nAge_12:', Age_12, '\nAge_Teen:', Age_Teen, '\nAge_Young', Age_Young, '\nAge_Other:', Age_Other)

data.count()

Survived_Yes: 290
Survived_No: 424

Age_12: 62
Age_Teen: 95
Age_Young 247
Age_Other: 303

Age         714
Survived    714
dtype: int64

Calculate marginal counts for survive categories:

In [5]:
Survived_12_Yes = len(data.query('Age >= 1 & Age <= 12 & Survived == 1'))
Survived_12_No = Age_12 - Survived_12_Yes

Survived_Teen_Yes = len(data.query('Survived == 1 & Age >= 13 & Age <= 19'))
Survived_Teen_No = Age_Teen - Survived_Teen_Yes

Survived_Young_Yes = len(data.query('Survived == 1 & Age >= 20 & Age < 31'))
Survived_Young_No = Age_Young - Survived_Young_Yes

Survived_Other_Yes = len(data.query('Survived == 1 & Age >= 31'))
Survived_Other_No = Age_Other - Survived_Other_Yes

print('Survived_12_Yes:', Survived_12_Yes, '\nSurvived_12_No:', Survived_12_No, '\n\nSurvived_Teen_Yes', Survived_Teen_Yes, '\nSurvived_Teen_No', Survived_Teen_No, '\n\nSurvived_Young_Yes', Survived_Young_Yes, '\nSurvived_Young_No', Survived_Young_No, '\n\nSurvived_Other_Yes:', Survived_Other_Yes,  '\nSurvived_Other_No:', Survived_Other_No)

Survived_12_Yes: 33
Survived_12_No: 29

Survived_Teen_Yes 39
Survived_Teen_No 56

Survived_Young_Yes 87
Survived_Young_No 160

Survived_Other_Yes: 124
Survived_Other_No: 179

Calculate marginal counts for age categories:

Calculate total count of samples:

In [6]:
Total = Survived_Yes + Survived_No
print('Total People with Valid data:', Total)

Total People with Valid data: 714

Store all of the counts calculated above into the data frame "Count"<br>
.    Column headers: Age categories and TOTAL<br>
.    Row headers: survive categories, TOTAL<br>
Print the object Count's content:

In [7]:
Count = pd.DataFrame([[Survived_12_Yes, Survived_Teen_Yes, Survived_Young_Yes, Survived_Other_Yes, Survived_Yes], 
                      [Survived_12_No, Survived_Teen_No, Survived_Young_No, Survived_Other_No, Survived_No], 
                      [Age_12, Age_Teen, Age_Young, Age_Other, Total]],
                      columns=['Age_12', 'Age_Teen', 'Age_Young', 'Age_Other', 'Total'], 
                      index=['Yes', 'No', 'Total'])

Count

       Age_12  Age_Teen  Age_Young  Age_Other  Total
Yes        33        39         87        124    290
No         29        56        160        179    424
Total      62        95        247        303    714

Save Counts into the text file "Count.csv" under the folder "OUTPUT".<br>
.    Column headers: Age categories and TOTAL<br>
.    Row headers: survive categories, TOTAL:

In [8]:
Count.to_csv('OUTPUT/Count.csv')

## Calculate Probabilities

Generate the Probability Table T2- P() as described. Store into the data frame object "P". Print the object's content:

In [9]:
#P = pd.DataFrame(columns=['Age_12', 'Age_Teen', 'Age_Young', 'Age_Other', 'Total'], index=['Survived', 'Not Survived', 'Total'])
#The probability that given a random person they fall into which group, like roulette betting
P = Count.div(Total)
P

         Age_12  Age_Teen  Age_Young  Age_Other     Total
Yes    0.046218  0.054622   0.121849   0.173669  0.406162
No     0.040616  0.078431   0.224090   0.250700  0.593838
Total  0.086835  0.133053   0.345938   0.424370  1.000000

Generate the Probability Table T3_1- P(Survive | Age) as described. Store into the data frame object "P_SgA". Print the object's content:

In [19]:
Total_Df = Count.loc['Total']
P_SgA = pd.DataFrame([Count.loc['Yes'].div(Total_Df),
                     Count.loc['No'].div(Total_Df),
                     Count.loc['Total'].div(Total_Df)],
                     index=['Survived | Age', 'Not Survived | Age', 'Total'])

P_SgA = P_SgA.drop(columns=['Total'])
P_SgA

                      Age_12  Age_Teen  Age_Young  Age_Other
Survived | Age      0.532258  0.410526   0.352227   0.409241
Not Survived | Age  0.467742  0.589474   0.647773   0.590759
Total               1.000000  1.000000   1.000000   1.000000

Generate the Probability Table T3_2- P(Survive | Age) P(Age) as described. Store into the data frame object "P_SgA_A". Print the object's content:

In [11]:
#Last row of P df for storing
Total_Probabilities_Ages_Df = P[-1:] 

Age_12_Prob = P_SgA["Age_12"].mul(Total_Probabilities_Ages_Df.iloc[0,0])

Age_Teen_Prob = P_SgA["Age_Teen"].mul(Total_Probabilities_Ages_Df.iloc[0,1])

Age_Young_Prob = P_SgA["Age_Young"].mul(Total_Probabilities_Ages_Df.iloc[0,2])

Age_Other_Prob = P_SgA["Age_Other"].mul(Total_Probabilities_Ages_Df.iloc[0,3])

#Total_Prob = P_SgA["Total"].mul(Total_Probabilities_Ages_Df.iloc[0,4])

#pd.DataFrame([Age_12_Prob, Age_Teen_Prob, Age_Young_Prob, Age_Other_Prob], index=['Survived | Age', 'Not Survived | Age', 'Total'])
#Total_Prob

Generate the Probability Table T4_1- P(Age | Survive) as described. Store into the data frame object "P_AgS". Print the object's content:

In [12]:
P_AgS = Count.drop('Total')

P_AgS = P_AgS.apply(lambda x: x / P_AgS.iloc[:,-1])
P_AgS

       Age_12  Age_Teen  Age_Young  Age_Other  Total
Yes  0.113793  0.134483   0.300000   0.427586    1.0
No   0.068396  0.132075   0.377358   0.422170    1.0

Generate the Probability Table T4_2- P(Age | Survive) P(Survive) as described. Store into the data frame object "P_AgS_S". Print the object's content:

In [13]:
P_SgA
#p_AgS_S = P_AgS.apply(lambda x: x *)

                      Age_12  Age_Teen  Age_Young  Age_Other
Survived | Age      0.532258  0.410526   0.352227   0.409241
Not Survived | Age  0.467742  0.589474   0.647773   0.590759
Total               1.000000  1.000000   1.000000   1.000000

## Compare

Compare the row TOTAL of T3_1- P(Survive | Age) with the row TOTAL of T2- P(). Explain:

In [14]:
display(P)
display(P_SgA)
#The row total in P_SgA shows that 100% of all people either Survived or Not Survived
#The row total in P shows the probability that someone choosen at random would have Survived/Not Survived
#in that Age_Group
#The Total's for P show a different type of probability that is conditional on knowing the Age first and then
#determining if they likely survived

         Age_12  Age_Teen  Age_Young  Age_Other     Total
Yes    0.046218  0.054622   0.121849   0.173669  0.406162
No     0.040616  0.078431   0.224090   0.250700  0.593838
Total  0.086835  0.133053   0.345938   0.424370  1.000000

                      Age_12  Age_Teen  Age_Young  Age_Other
Survived | Age      0.532258  0.410526   0.352227   0.409241
Not Survived | Age  0.467742  0.589474   0.647773   0.590759
Total               1.000000  1.000000   1.000000   1.000000

Compare the row TOTAL of T3_2- P(Survive | Age) P(Age) with the row TOTAL of T2- P(). Explain:

In [15]:
#Since we multiply each age value with its respective probability, 
#we receive the original probability for each type. Therefore,
#we find that T3_2 and T2 are equivalent.

Compare the column TOTAL of T4_1- P(Age | Survive) with the column TOTAL of T2- P(). Explain:

In [16]:
display(P)
display(P_AgS)
#The Column Total of P_AgS shows that all the values of those that Survived do add up to the correct number
#of people we know survived
#This ensures that our data does account for all the values we were given and we have no values unsorted. 
#Whereas The Column Total in P shows that roughly 40% of people survived and 60% of people did not survive that titanic

         Age_12  Age_Teen  Age_Young  Age_Other     Total
Yes    0.046218  0.054622   0.121849   0.173669  0.406162
No     0.040616  0.078431   0.224090   0.250700  0.593838
Total  0.086835  0.133053   0.345938   0.424370  1.000000

       Age_12  Age_Teen  Age_Young  Age_Other  Total
Yes  0.113793  0.134483   0.300000   0.427586    1.0
No   0.068396  0.132075   0.377358   0.422170    1.0

Compare the column TOTAL of T4_2- P(Age | Survive) P(Survive) with the column TOTAL of T2- P(). Explain:

## <center> REFERENCES </center>
List resources (book, internet page, etc.) that you used to complete this challenge.